In [1]:
people = {
    'first':['Corey','Jane','John'],
    'last':['Schafer','Doe','Doe'],
    'email':['CoreyMSchafer@gmail.com','JaneDoe@email.com','JohnDoe@email.com'],
    
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [6]:
df['full_name'] = df['first'] + ' ' + df['last']

In [7]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

# 데이터 프레임 삭제(행&열)

In [11]:
df.drop(columns=['first','last'], inplace=True) # inplace = True 파라미터를 넣어줘야 df에 변화가 적용됨

In [12]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

## string split해서 columns으로 만들기

In [14]:
df['full_name'].str.split(' ', expand=True) # expand=True 파라미터를 통해서 dataframe으로 변형시킬수 있음

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [15]:
df[['first','last']] = df['full_name'].str.split(' ', expand=True)

In [16]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

## row 추가 삭제하기
### 1. single row 추가
### 2. 2개의 dataframe을 1개의 dataframe으로  바꾸기

In [19]:
df.append({'first':'Tony'}, ignore_index=True) # ignore_index=True의 경우, index 오류 발생 없이 추가해줌. 나머지는 NaN으로 할당됨

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

#### 기존 데이터 프레임을 다른 데이터 프레임에 추가하기

In [20]:
people = {
    'first':['Tony','Steve'],
    'last':['Stark','Rogers'],
    'email':['IronMan@avenge.com','Cap@avenge.com'],    
}
df2 = pd.DataFrame(people)

In [21]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [30]:
df.append(df2, ignore_index=True) #만약 ignore_index=False나 아무것도 안넣으면 새로 추가된 row부터 인덱스가 0부터 누적되어 자동 생성됨.

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [35]:
df # 만약 위의 변화된 데이터 프레임을 저장하고자 한다면 = 할당 연산자를 이용함(inplace=True 파라미터 사용불가X, 단 drop은 inplace사용OK)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [39]:
df = df.append(df2, ignore_index=True)

In [40]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers
5       IronMan@avenge.com            NaN   Tony    Stark
6           Cap@avenge.com            NaN  Steve   Rogers
7       IronMan@avenge.com            NaN   Tony    Stark
8           Cap@avenge.com            NaN  Steve   Rogers

In [48]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
5       IronMan@avenge.com            NaN   Tony    Stark
6           Cap@avenge.com            NaN  Steve   Rogers
7       IronMan@avenge.com            NaN   Tony    Stark

## row 삭제

In [51]:
df = df.drop(index=[5,6,7])

In [52]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark

In [56]:
df['last']  == 'Doe'

0    False
1     True
2     True
3    False
Name: last, dtype: bool

In [57]:
filt = df['last']  == 'Doe'
df.drop(index=df[filt].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark